Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd
The serialization structure for AnalysisPartEnd.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._Condition
The condition of the part end.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._Connectivity
The connectivity of the part end.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._Support
The support of the part end.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._SupportCoordSystem
The coordinate system of the support.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._EccentricityMode
The eccentricity mode of the part end.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd._Eccentricity
The eccentricity of the part end.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd.ToStruct(Tekla.Structures.Analysis.AnalysisPartEnd)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartEnd.FromStruct(Tekla.Structures.Analysis.AnalysisPartEnd)
DO NOT USE! For internal usage only!
P: P.